# BLACK FRIDAY DATASET

EDA AND FEATURING ENGINEERING & PREPARE DATA FOR MODEL BUILDING

In [154]:
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

Reading Dataset

In [155]:
df_train = pd.read_csv("C:\\Users\\harip\\Desktop\\Projects\\data\\blackfriday\\train.csv")
df_test = pd.read_csv("C:\\Users\\harip\\Desktop\\Projects\\data\\blackfriday\\test.csv")

In [156]:
# Shape of the data
print(f'Trian shape : {df_train.shape}, Test shape :{df_test.shape}')

Trian shape : (550068, 12), Test shape :(233599, 11)

In [157]:
# model training using this 
df_train.head(2)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200

In [158]:
# here we dont have the output variable
df_test.head(2)

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN

##### Problem Statement : Understand the Cutomer Purchase behaviour (mainly Purchase amount), against various product of different categories. We have summary of various customer for selected high volume product of last month. The data set also contains customer demographics (Age, Gender, Marital Status, city_type , stay_in_current_city), Product details (product_id,product_category)and Total purchase_amount from last month

#####  Build a model to predict the purchase of customer against the product for personalized offer to the customer

Always combine the dataset so, we can perform test on both data

In [159]:
df = df_train._append(df_test)
# This joins data by rows, we can do it with merge as well 
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [160]:
df.info() # checking data types and values
# Here age is given in Range

<class 'pandas.core.frame.DataFrame'>
Index: 783667 entries, 0 to 233598
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  object
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 77.7+ MB

In [161]:
round(df.describe(),2)

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,783667.00,783667.00,783667.00,783667.00,537685.00,237858.00,550068.00
mean,1003029.00,8.08,0.41,5.37,9.84,12.67,9263.97
std,1727.27,6.52,0.49,3.88,5.09,4.13,5023.07
min,1000001.00,0.00,0.00,1.00,2.00,3.00,12.00
25%,1001519.00,2.00,0.00,1.00,5.00,9.00,5823.00
50%,1003075.00,7.00,0.00,5.00,9.00,14.00,8047.00
75%,1004478.00,14.00,1.00,8.00,15.00,16.00,12054.00
max,1006040.00,20.00,1.00,20.00,18.00,18.00,23961.00

In [162]:
# From this above Col we will remove  User_Id cause we have no use
df.drop('User_ID',axis=1,inplace=True)
df.head(1)

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0

In [163]:
# df['Gender'] = pd.get_dummies(df['Gender'], drop_first=True)
# simple 0,1 Convertion 
# https://www.educative.io/answers/what-is-the-getdummies-function-i
# df.head(3)

In [164]:
df.head(2)

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0

One way of converting the categorical values into Numerical

1. Handling Categorical Values of Gender

In [165]:
df['Gender'] = df['Gender'].replace({'F' :1, 'M' : 0}) 
# NOTE Or you can use replace
# df['Gender] = df['Gender'].map({'F' : 0, 'M' : 1})

C:\Users\harip\AppData\Local\Temp\ipykernel_30044\1226395619.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Gender'] = df['Gender'].replace({'F' :1, 'M' : 0})

In [166]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,1,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,1,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,1,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,1,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,0,55+,16,C,4+,0,8,NaN,NaN,7969.0

2. Handling Categorical Values Age

In [167]:
# Because age is in Range ,so they are categorical
df.Age.unique() # array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25']
#df.Age.value_counts()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [168]:
# So now we can apply encoding for this as well
# pd.get_dummies(df['Age'], drop_first=True) # not a good paractice, but we can use Map function

# NOTE we will use map Target Value Encoding 
df['Age'] = df['Age'].map({'0-17' : 1 , '18-25' : 2, '26-35' : 3, '36-45': 4, '46-50' : 5, '51-55' : 6, '55+' : 7}) # NOTE dont put zero
# Again lable encoding will also work , NOTE SECOND TECHNIQUE  :-> https://www.geeksforgeeks.org/ml-label-encoding-of-datasets-in-python/

In [169]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,1,1,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,1,1,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,1,1,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,1,1,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,0,7,16,C,4+,0,8,NaN,NaN,7969.0